In [1]:
import mysql.connector
from faker import Faker
import random
from datetime import datetime, timedelta
import pandas as pd
print("All set up")

All set up

In [2]:
conn = mysql.connector.connect(
    host="127.0.0.1",
    port=3307,
    user="sadop_user",
    password="1234",
    database="sadop_DB"
)
cursor = conn.cursor()
print("Connected to SADOP database")

Connected to SADOP database

In [3]:
cursor.execute("SELECT * FROM Users LIMIT 10;")
users = cursor.fetchall()
for u in users:
    print(u)

(1, 'Heidi Curtis', 'taralarsen@example.com', '400.279.0261x640', datetime.datetime(2024, 11, 19, 15, 33, 21))
(2, 'Craig Kelley', 'kevinbell@example.net', '001-799-995-8042', datetime.datetime(2025, 3, 19, 21, 41, 51))
(3, 'Lisa Boone', 'ophillips@example.net', '(324)739-4975x111', datetime.datetime(2025, 6, 26, 18, 21, 4))
(4, 'Barbara Thomas', 'changlori@example.com', '795-409-3560', datetime.datetime(2023, 12, 1, 12, 7, 30))
(5, 'Karen Johnson', 'ashleydavis@example.org', '+1-474-562-7359', datetime.datetime(2025, 5, 23, 23, 23, 18))
(6, 'Cheryl Kelly', 'rporter@example.com', '001-669-860-3849', datetime.datetime(2023, 2, 18, 22, 44, 2))
(7, 'Luke Fritz', 'neil65@example.net', '001-824-408-0861x657', datetime.datetime(2024, 11, 30, 14, 37, 37))
(8, 'Jennifer Rowe', 'austinbarnes@example.org', '923.322.7498x3475', datetime.datetime(2023, 12, 18, 8, 57, 4))
(9, 'Robert Hoffman', 'yallen@example.org', '001-559-592-5407x927', datetime.datetime(2024, 3, 30, 20, 44, 20))
(10, 'Courtney Mason', 'crawfordalicia@example.com', '+1-750-392-9784x725', datetime.datetime(2024, 4, 17, 6, 17, 19))

In [4]:
df_users = pd.read_sql("SELECT * FROM Users LIMIT 10000;", conn)
df_users

C:\Users\pc\AppData\Local\Temp\ipykernel_17860\1010626938.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_users = pd.read_sql("SELECT * FROM Users LIMIT 10000;", conn)

,user_id,name,email,phone,created_at
0,1,Heidi Curtis,taralarsen@example.com,400.279.0261x640,2024-11-19 15:33:21
1,2,Craig Kelley,kevinbell@example.net,001-799-995-8042,2025-03-19 21:41:51
2,3,Lisa Boone,ophillips@example.net,(324)739-4975x111,2025-06-26 18:21:04
3,4,Barbara Thomas,changlori@example.com,795-409-3560,2023-12-01 12:07:30
4,5,Karen Johnson,ashleydavis@example.org,+1-474-562-7359,2025-05-23 23:23:18
...,...,...,...,...,...
9995,9996,Jason Moore,mallorysmith@example.net,9564579104,2024-12-16 04:33:57
9996,9997,Angela Taylor,jamesthomas@example.com,001-271-337-4973x729,2025-09-27 23:54:22
9997,9998,Stephanie Austin,oreid@example.net,+1-359-388-3416x9542,2024-03-08 04:23:42
9998,9999,Patricia Phillips,imelendez@example.org,+1-536-367-4567x639,2023-11-20 11:15:59
9999,10000,Heather Beasley,davislawrence@example.net,(862)813-2221x919,2024-01-14 09:59:13

In [5]:
df_Accounts = pd.read_sql("SELECT * FROM Accounts LIMIT 19968;", conn)
df_Accounts

C:\Users\pc\AppData\Local\Temp\ipykernel_17860\4282813482.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_Accounts = pd.read_sql("SELECT * FROM Accounts LIMIT 19968;", conn)

       account_id  user_id      type  balance          created_at
0               1      953  checking  6095.10 2025-04-26 13:13:16
1               2     6799  checking  9386.34 2024-02-06 15:47:42
2               3     6799   savings  2110.29 2023-07-02 10:42:42
3               4     5020  checking  1753.93 2023-07-05 05:40:00
4               5     5020   savings  6424.18 2025-02-07 12:16:29
...           ...      ...       ...      ...                 ...
19963       19964      848  checking  5386.29 2024-03-18 09:29:07
19964       19965      848  checking  7709.19 2025-12-02 03:28:17
19965       19966      848  checking  6382.53 2023-07-09 15:30:08
19966       19967      194  checking  1513.36 2024-09-24 16:00:58
19967       19968      194   savings  1272.07 2023-04-05 16:46:22

[19968 rows x 5 columns]

In [10]:
df_transactions = pd.read_sql("SELECT * FROM Transactions LIMIT 6672;", conn)
df_transactions

C:\Users\pc\AppData\Local\Temp\ipykernel_24060\2853590681.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_transactions = pd.read_sql("SELECT * FROM Transactions LIMIT 6672;", conn)

      transaction_id  account_id  amount    type           timestamp
0                  1           5  848.54   debit 2025-01-14 05:54:30
1                  2           5  210.45  credit 2025-10-27 05:12:51
2                  3           5  888.03  credit 2025-06-18 20:39:06
3                  4           5  238.47   debit 2025-05-25 13:58:27
4                  5           5  594.86   debit 2025-11-25 01:31:55
...              ...         ...     ...     ...                 ...
6667            6668         145  691.50   debit 2024-10-07 12:21:14
6668            6669         145   56.02  credit 2025-03-17 11:36:23
6669            6670         145   35.37  credit 2025-11-16 17:26:00
6670            6671         145  607.89   debit 2024-06-15 07:43:04
6671            6672         145  544.67   debit 2024-04-19 08:29:37

[6672 rows x 5 columns]

In [6]:
df_logs = pd.read_sql("SELECT * FROM Logs LIMIT 250188;", conn)
df_logs

C:\Users\pc\AppData\Local\Temp\ipykernel_17860\1506946026.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_logs = pd.read_sql("SELECT * FROM Logs LIMIT 250188;", conn)

       log_id  account_id               action  query_time           timestamp
0           1       17120        balance_check      2.4358 2025-08-22 15:39:10
1           2       17120         failed_login      1.8784 2025-04-29 02:57:16
2           3       17120               logout      1.4051 2025-02-21 02:11:47
3           4       17120        balance_check      0.1209 2024-12-25 01:35:33
4           5       17120         failed_login      0.8479 2025-02-04 02:04:00
...       ...         ...                  ...         ...                 ...
79844   79845        4216               logout      1.5736 2025-10-12 23:01:45
79845   79846        4217  suspicious_activity      3.5066 2025-11-22 01:01:40
79846   79847        4217              deposit      2.4016 2025-05-18 13:38:10
79847   79848        4217                login      1.8985 2025-08-09 13:05:40
79848   79849        4217        balance_check      1.1683 2025-06-10 18:58:51

[79849 rows x 5 columns]